[
    {
        "title":"Harley-Davidson riders on how motorcycles helped them find their purpose",
        "content":"Motorcycle groups are not just about fun and speed — for these two bikers, it's more about freedom and camaraderie.\n\nFrom raising money for charity to exploring untouched destinations, Yanisa, 43, and Mick, who is in his 50s, have had some epic adventures with their riding buddies and, of course, their trusty Harley-Davidson motorcycles.\n\nTheir inspirational stories came to light during Harley-Davidson's #HDFreedomStoriesAsia crowdsourcing campaign last July and August, which called for contributions from riders around the region.\n\nSpeaking to AsiaOne, the two Thai riders delve deeper into their hobby, which has now turned into a way of life."
    },
    {
        "title":"I'm the only woman in my group and at times, I also lead the group",
        "content":"Meet the woman who's breaking boundaries as her riding group's only woman.\n\nYanisa, who works as a distributor in the construction materials industry, is no stranger to getting around on a motorcycle. But it was only in March 2020 that she began to take it seriously as a hobby as she had \"nothing to do\" during the pandemic. \n\nIn fact, she was so serious about it that she sprang for her dream ride, a Pan America.\n\n\"I have always dreamed that if I could afford a nice motorcycle one day, it would be a Harley-Davidson,\" Yanisa says, adding that the bike is \"such a classic\".\n\nRather than using her bike just to commute, however, Yanisa began taking trips to the Thai countryside to immerse herself in nature. She particularly loves the northern provinces of Chiang Mai, Chiang Rai and Nan.\n\n\"Because I am so fond of nature, and most of the places we go to are very difficult to reach by car,\" explains Yanisa.\n\n\"Getting dirty, falling, or being a bit hurt is so fun.\"\n"
    },
    {
        "title":"Riding is a family affair",
        "content":"Gaming consultant Mick isn't the only motorcycle enthusiast in his family.\n\nMick, the assistant director of the Harley Owners' Group (HOG) Chiang Mai Chapter, says that not only does his wife ride on \"almost every trip\", but his eight-year-old son also tags along on some of his shorter expeditions.\n\nAnother constant in Mick's trips is his Road Glide — he tells us proudly that he's covered over 40,000km over the past two years, and he's not slowing down.\n\nEventually, the goal is to visit every single province in Thailand, he says.\n\n\"Not just passing through but living and covering all the interesting spots in every province.\"\n\nMick's bucket list also includes destinations that are a bit more far-flung. Think Cambodia, Vietnam, Malaysia, Singapore and the famed Route 66 in the United States.\n\n\"Riding has no definition nor exact meaning to it, you need to be on the bike to know that feeling,\" he says in an attempt to explain the allure of exploring uncharted territory on two wheels. \"As for me, it's the freedom in the open road and that connection to the surroundings, and it isn't about the destination that you are riding to, but the satisfaction in between.\"\n\nDespite the exotic destinations on his bucket list, Mick tells us that his most memorable trip so far has been a local one.\n"
    },
    {
        "title":"More stories of freedom",
        "content":"Yanisa's and Mick's stories are just two of the many uncovered during the #HDFreedomStoriesAsia crowd sourcing campaign. As part of the initiative, riders from Korea, Thailand, Malaysia, Philippines, Vietnam, Taiwan, Hong Kong, Macau, Singapore and Indonesia took to social media to share all about their journeys as Harley-Davidson riders, and what Harley-Davidson means to them.\n\nBesides celebrating Harley-Davidson riders in the region who share a deep-rooted relationship with the brand, the campaign also aimed to spotlight the camaraderie forged between them on the open road and inspire a new wave of riders.\n\nThe winning riders with the most unique and compelling stories were selected to be featured in Freedom Stories 2.0, a series of short films which served to preserve their treasured memories and inspire the next generation of riders.\n\nIf you've enjoyed reading all about Mick and Yanisa so far, the films, which focus on each rider's life, first rides, passions and their love for motorcycles, will be right up your alley.\n\nClick here to watch all the episodes in the series and be inspired by Mick and Yanisa.\n"
    }
]
